# ---------------------------------------------------------------------
# 9. ВЛОЖЕННЫЕ УСЛОВИЯ
# ---------------------------------------------------------------------

login = "student"
password = "python123"
ip_adress = "1231231223123"

if ip_adress == "123123123123":
    if login == "student":
        if password == "python123":
            print("Вход выполнен успешно.")
        else:
            print("Неверный пароль.")
    else:
        print("Пользователь не найден.")
else:
    print("Вы заходите из необычного места. Проверьте ВПН")